#ifndef CAPTURESETTING_HPP
#define CAPTURESETTING_HPP

#include <iostream>

#include <QSettings>
#include <QFile>
#include <QMetaEnum>

#include "../SDK/customexception.hpp"
#include "../SDK/formatconversion.hpp"

namespace App
{
    //>>>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    //enum
    enum class ImageBit //图像位数,包括8位和16位
    {
        BIT8,
        BIT16
    };
    //<<<----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

    /**
     *  @brief CaptureSetting
     *
     *  @author peter
     *  @version 1.00 2017-11-22 peter
     *                note:create it
     */
    class CaptureSetting
    {
    public:
        //>>>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
        // constructor & destructor
        /**
         * @brief CaptureSetting
         *      默认构造函数
         * @param N/A
         * @return N/A
         */
        CaptureSetting();
        /**
         * @brief ~CaptureSetting
         *      析构函数
         * @param N/A
         * @return N/A
         */
        virtual~CaptureSetting();
        //<<<----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------


        //>>>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
        // load function
        /**
         *  @brief loadCaptureSetting
         *      加载配置文件(配置文件存在则读取(read)文件，不存在则直接退出程序
         *  @param path
         *      待加载的配置文件路径
         *  @return N/A//
         */
        void loadCaptureSetting( const QString& path );
        //<<<----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

    private:
        //>>>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
        //read & write function
        /**
         *  @brief readCaptureSetting
         *      读取配置文件中的信息(配置文件存在)
         *  @param path
         *      待读取的配置文件路径
         *  @return N/A
         */
        void readCaptureSetting( const QString& path );
        void writeCaptureSetting( const QString& path );
        //<<<----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

    private:
        int m_imageWidth {100};
        int m_imageHeight {100};
        ImageBit m_imageBit {ImageBit::BIT8};


    };
}//End of namespace App

#endif // CAPTURESETTING_HPP
